In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [27]:
ser1 = Series(np.arange(3), index=['a','b','c'])

In [28]:
ser1 = ser1*2

In [31]:
ser1

a    0
b    2
c    4
dtype: int32

In [32]:
# get a row by index
ser1['b']

2

In [33]:
# get a row by numerical index

ser1[1]

2

In [35]:
# get rows by range
ser1[0:2]

a    0
b    2
dtype: int32

In [37]:
# get rows by list of indexes
ser1[[0,2]]

a    0
c    4
dtype: int32

In [39]:
# get rows by boolean logic
ser1[ser1 >= 2]

b    2
c    4
dtype: int32

In [41]:
# set rows by boolean logic
ser1[ser1 <=2] = 2

In [42]:
ser1

a    2
b    2
c    4
dtype: int32

In [44]:
# create 5x5 matrix
#  cities as indices
#  letters as  columns

df = DataFrame(np.arange(25).reshape(5,5),
              index=['ATL','BOS','NYC','CH','SF'],
              columns=['A','B','C','D','E'])

In [54]:
# select specific columns by names
df[['B','C']]

# another approach same result
DataFrame(df,columns=['B','C'])

      B   C
ATL   1   2
BOS   6   7
NYC  11  12
CH   16  17
SF   21  22

In [55]:
# select rows where specific column is greater than 8
df[df['B'] > 10]

      A   B   C   D   E
NYC  10  11  12  13  14
CH   15  16  17  18  19
SF   20  21  22  23  24

In [56]:
# get a boolean data frame
df > 10

         A      B      C      D      E
ATL  False  False  False  False  False
BOS  False  False  False  False  False
NYC  False   True   True   True   True
CH    True   True   True   True   True
SF    True   True   True   True   True

In [59]:
# use loc to retrieve a row by index
df.loc['ATL']

A    0
B    1
C    2
D    3
E    4
Name: ATL, dtype: int32